Merge pull request #1 from redhatrises/updates
chore: various fixes and updates
